app/Controllers/MouvementController.php

SELECT *
FROM `bareme`
WHERE 101 BETWEEN min AND max
 LIMIT 1
---
    public function deductionFrais($montant) {
        $ligne = $this->bareme->where("{$montant} BETWEEN min AND max")->first();

SELECT SUM(
                CASE 
                    WHEN idOperation IN (2, 3) THEN -argent
                    ELSE argent                              
                END
            ) AS solde
FROM `mouvement`
WHERE `idN1` = 1
 LIMIT 1
---
    public function getSolde($idNum) {
        $resultat = $this->mouvement->select("
            SUM(
                CASE
                    WHEN idOperation IN (2, 3) THEN -argent
                    ELSE argent
                END
            ) AS solde
        ", false)->where('idN1', $idNum)->first();

INSERT INTO `mouvement` (`idN1`, `idOperation`, `argent`) VALUES (1, 1, '15000')
---
    public function depot() {
        $data = $this->getDataDepotRetrait();

        if (!is_array($data)) {
            return $data;
        }

        $idNum = $data['idNum'];
        $montant = $data['montant'];

        $donnee = [
            "idN1" => $idNum,
            "idOperation" => 1,
            "argent" => $montant
        ];

        $this->mouvement->save($donnee);

INSERT INTO `mouvement` (`idN1`, `idOperation`, `argent`) VALUES (1, 2, 151)
---
    public function retrait() {
        $data = $this->getDataDepotRetrait();

        if (!is_array($data)) {
            return $data;
        }

        $idNum = $data['idNum'];
        $montant = $data['montant'];

        $solde = $this->getSolde($idNum);
        $montant = $this->deductionFrais($montant);

        if($solde < $montant) {
            $necessaire = $montant - $solde;
            return redirect()->to('/accueil')->with('error', "Solde insuffisant. Il vous manque {$necessaire} Ar pour couvrir le retrait et ses frais.");
        }

        $donnee = [
            "idN1" => $idNum,
            "idOperation" => 2,
            "argent" => $montant
        ];
        $this->mouvement->save($donnee);

SELECT *
FROM `mouvement`
WHERE `idN1` = 1
AND `idOperation` = 3
ORDER BY `id` DESC
---
    public function historique() {
        $idNum = session()->get('id_numero');
        if (!$idNum) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
        }

        $filtre = $this->request->getPost('filtre') ?? 'tout';

        $query = $this->mouvement->where('idN1', $idNum);

        switch ($filtre) {
            case 'depot':
                $query->where('idOperation', 1);
                break;
            case 'retrait':
                $query->where('idOperation', 2);
                break;
            case 'transfert':
                $query->where('idOperation', 3);
                break;
            case 'tout':
                default:
                break;
        }

    $listeMouvements = $query->orderBy('id', 'DESC')->findAll();