app/Models/Numero.php

    public function findBySequence($sequence) {
        return $this->where('sequence', $sequence)->first();
---
SELECT *
FROM `numero`
WHERE `sequence` = '0334621231'
 LIMIT 1